Infineon/mtb-example-psoc6-ble-capsense-tuner-client/tuner_ble_client.c
/*******************************************************************************
* File Name: tuner_ble_client.c
*
* Description: This file contains BLE related functions.
*
* Related Document: README.md
*
********************************************************************************
* Copyright (2020), Cypress Semiconductor Corporation. All rights reserved.
********************************************************************************
* This software, including source code, documentation and related materials
* ("Software"), is owned by Cypress Semiconductor Corporation or one of its
* subsidiaries ("Cypress") and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software ("EULA").
*
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Cypress's integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Cypress against all liability.
*******************************************************************************/

/*******************************************************************************
 * Include header files
 ******************************************************************************/
#include "cyhal.h"
#include "cybsp.h"
#include "cycfg_ble.h"
#include "cy_retarget_io.h"
#include "cy_pdl.h"
#include "tuner_ble_client.h"
#include "main.h"


/*******************************************************************************
* Macros
*******************************************************************************/
#define ENABLE                      (1u)
#define DISABLE                     (0u)
#define DEBUG_BLE_ENABLE            (DISABLE)
#define CY_ASSERT_FAILED            (0u)

#if DEBUG_BLE_ENABLE
#define DEBUG_BLE                   (printf)
#else
#define DEBUG_BLE(...)
#endif

#define BLESS_INTR_PRIORITY         (1u)
#define GATT_MTU_MAX                (512u)
#define CY_BLE_BD_ADDR_SIZE         (0x06u)
#define GATT_CCCD_LEN               (0x02u)
#define GATT_CCCD_NTF_ENABLE        (ENABLE)
#define AD_TYPE_COMPLETE_LOCAL_NAME (9u)

/* Handle of CapSense_DS characteristic */
#define CAPSENSE_DS_CHAR_HANDLE     (0x0009u)

/* Handle of Client Characteristic Configuration descriptor */
#define CAPSENSE_DS_CCCD_HANDLE     (0x000Au)

/* Length of notification packet received from GATT Server to initialize EZI2C bridge
 * Size of CapSense data structure:(2 bytes)
 * No. of notification packets to receive complete CapSense data: (1 byte) */
#define CAPSENSE_DS_SIZE_LSB_IDX    (0u)
#define CAPSENSE_DS_SIZE_MSB_IDX    (1u)
#define NOTIFICATION_COUNT_IDX      (2u)
#define TUNER_BRIDGE_INIT_NTF_SIZE  (3u)


/*******************************************************************************
*        Function Prototypes
*******************************************************************************/
static void stack_event_handler(uint32_t event, void* eventParam);
static void ble_assert(void);
static void bless_interrupt_handler(void);
static uint8_t* adv_parser(uint16_t ad_type, cy_stc_ble_gapc_adv_report_param_t *scan_report, uint8_t *adv_type_length);


/*******************************************************************************
 * Global variables
 ******************************************************************************/
/* Variable is set when a notification is received from GATT Server */
bool notify = false;

/* Variable to store no. of notification packets to receive complete CapSense data */
uint8_t max_notificaion_count = 1;

/* Variable to check if target gap peripheral device is found or not */
static bool target_found = false;

/* Variable to check if ezi2c bridge is initialized or not */
static bool bridge_initialised = false;

/* Variable to enable or disable notifications in GATT Server */
static uint8_t cccd_val[CY_BLE_CCCD_LEN] = {DISABLE, DISABLE};

/* Variable to store connection handle */
cy_stc_ble_conn_handle_t conn_handle;

/* Variable to store notification data received from server */
cy_stc_ble_gattc_handle_value_ntf_param_t notification_data;

/* Constant to store server name and use during scanning */
static const char target_name[] = "CapSense_GATT_Server";

/* Variable to hold the address of the peer device */
static cy_stc_ble_gap_bd_addr_t peer_addr;

/* Variable to hold advertisement report parameter */
static cy_stc_ble_gapc_adv_report_param_t adv_report;


/*******************************************************************************
* Function Name: bless_interrupt_handler
********************************************************************************
* Summary:
*  Wrapper function for handling interrupts from BLESS.
*
*******************************************************************************/
static void bless_interrupt_handler(void)
{
    Cy_BLE_BlessIsrHandler();
}


