Infineon/mtb-example-psoc6-ble-capsense-tuner-client/tuner_ble_client.c
/*******************************************************************************
 * Function Name: ble_init()
 *******************************************************************************
 *
 * Summary:
 *   This function initializes the BLE for use in the code example.
 *
 ******************************************************************************/
void ble_init(void)
{
    /* Variable to store common error codes received as API result */
    cy_en_ble_api_result_t api_result = CY_BLE_SUCCESS;

    /* BLESS interrupt configuration structure */
    const cy_stc_sysint_t  blessIsrCfg =
    {
        /* The BLESS interrupt */
        .intrSrc       = bless_interrupt_IRQn,

        /* The interrupt priority number */
        .intrPriority  = BLESS_INTR_PRIORITY
    };

    /* Initialize the BLESS interrupt */
    cy_ble_config.hw->blessIsrConfig = &blessIsrCfg;

    /* Hook interrupt service routines for BLESS */
    Cy_SysInt_Init(cy_ble_config.hw->blessIsrConfig, bless_interrupt_handler);

    /* Register the generic event handler */
    Cy_BLE_RegisterEventCallback(stack_event_handler);

    /* Initialize the BLE host */
    api_result = Cy_BLE_Init(&cy_ble_config);

    if (api_result != CY_BLE_SUCCESS)
    {
        /* BLE stack initialization failed, check configuration,
         * notify error and halt CPU in debug mode */
        DEBUG_BLE("Cy_BLE_Init API Error: %x \r\n", api_result);
        ble_assert();
    }
    else
    {
        DEBUG_BLE("Cy_BLE_Init API Success: %x \r\n", api_result);
    }

    /* Enable BLE */
    api_result = Cy_BLE_Enable();

    if (api_result != CY_BLE_SUCCESS)
    {
        /* BLE stack initialization failed, check configuration,
         * notify error and halt CPU in debug mode */
        DEBUG_BLE("Cy_BLE_Enable API Error: %x \r\n", api_result);
        ble_assert();
    }
    else
    {
        DEBUG_BLE("Cy_BLE_Enable API Success: %x \r\n", api_result);
    }
}


/*******************************************************************************
* Function Name: stack_event_handler
********************************************************************************
*
* Summary:
*   This is an event callback function to receive events from the BLE stack.
*
* Parameters:
*  uint32_t event:      event from the BLE stack
*  void* eventParam:  parameters related to the event
*
*******************************************************************************/
static void stack_event_handler(uint32_t event, void* eventParam)
{
    cy_en_ble_api_result_t api_result = CY_BLE_SUCCESS;

    switch(event)
    {
        /***********************************************************************
         *                       General Events
         **********************************************************************/
        case CY_BLE_EVT_STACK_ON:
        {
            /* Stack initialized; ready for scan */
            DEBUG_BLE("CY_BLE_EVT_STACK_ON \r\n");
            printf("Scanning for GAP Peripheral with device name %s\n\r",\
                                                               target_name);
            /* Start scan */
            Cy_BLE_GAPC_StartScan(CY_BLE_SCANNING_FAST,\
                                  CY_BLE_CENTRAL_CONFIGURATION_0_INDEX);
            break;
        }

        /* This event is received when there is a timeout. */
        case CY_BLE_EVT_TIMEOUT:
        {
            DEBUG_BLE("CY_BLE_EVT_TIMEOUT \r\n");
            break;
        }

        /***********************************************************************
         *                     GAP Central Events
         **********************************************************************/

        /* This event is triggered every time a device is discovered */
        case CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT:
        {
            /* A new device listed in the scan report */
            adv_report = *(cy_stc_ble_gapc_adv_report_param_t *)eventParam;

            /* Pointer to store return value from advertisement parser */
            char* peer_name = NULL;
            uint8_t name_length = 0u;

            /* Process only for Advertisement packets, not on scan response
             * packets */
            if(adv_report.eventType != CY_BLE_GAPC_SCAN_RSP)
            {
                peer_name = (char*) adv_parser(AD_TYPE_COMPLETE_LOCAL_NAME,\
                                                     &adv_report, &name_length);

                if(peer_name  == NULL)
                {
                    target_found = false;
                    break;
                }
                /* Compare peer name with "CapSense_GATT_Server" */
                else
                {
                    peer_name[name_length]= '\0';
                    target_found = ((strcmp(peer_name, target_name)) ? false : true);
                }
                if (target_found)
                {
                    /* Stop Scan */
                    Cy_BLE_GAPC_StopScan();
                }
            }
            break;
        }

        /* The central device has started/stopped scanning */
        case CY_BLE_EVT_GAPC_SCAN_START_STOP:
        {
            if(Cy_BLE_GetScanState() == CY_BLE_SCAN_STATE_STOPPED)
            {
                if(target_found == true)
                {
                    /* Scan stopped manually; do not restart scan */
                    target_found = false;

                    /* Get address and address type of the peer device to
                     * initiate connection */
                    for(uint8_t i = 0u; i < CY_BLE_BD_ADDR_SIZE; i++)
                    {
                        peer_addr.bdAddr[i] = adv_report.peerBdAddr[i];
                    }

                    printf("Found Peer Device with address:");

                    /* Print the peer bd address on UART terminal */
                    for(uint8_t i = (CY_BLE_BD_ADDR_SIZE); i > 0u; i--)
                    {
                        printf(" %X", peer_addr.bdAddr[i - 1u]);
                    }

