Infineon/mtb-example-psoc6-ble-capsense-tuner-client/tuner_ble_client.c
                    /* Get the peer address type */
                    peer_addr.type = adv_report.peerAddrType;

                    /* Initiate connection with discovered peer device */
                    api_result = Cy_BLE_GAPC_ConnectDevice(&peer_addr,\
                                          CY_BLE_CENTRAL_CONFIGURATION_0_INDEX);
                    if(api_result == CY_BLE_SUCCESS)
                    {
                         DEBUG_BLE("Initiated GAP connection..\r\n");
                    }
                    else
                    {
                         printf("Failed to initiate connection %u \r\n",\
                                                                    api_result);
                         ble_assert();
                    }
                }
            }
            break;
        }

        /* This event is triggered when there is a change to either the maximum
         * Payload length or the maximum transmission time of Data Channel PDUs
         * in either direction
         */
        case CY_BLE_EVT_DATA_LENGTH_CHANGE:
        {
            DEBUG_BLE("CY_BLE_EVT_DATA_LENGTH_CHANGE\r\n");
            cy_stc_ble_set_phy_info_t phyParam;

            /* Set the PHY for the current connection to 2M */
            phyParam.bdHandle = conn_handle.bdHandle;
            phyParam.allPhyMask = CY_BLE_PHY_NO_PREF_MASK_NONE;
            phyParam.phyOption = 0;
            phyParam.rxPhyMask = CY_BLE_PHY_MASK_LE_2M;
            phyParam.txPhyMask = CY_BLE_PHY_MASK_LE_2M;

            api_result = Cy_BLE_SetPhy(&phyParam);
            if(api_result != CY_BLE_SUCCESS)
            {
                DEBUG_BLE("Failed to set PHY..[bdHandle 0x%02X] : 0x%4x\r\n",
                        phyParam.bdHandle, api_result);
            }
            else
            {
                DEBUG_BLE("Setting PHY.[bdHandle 0x%02X] \r\n",\
                           phyParam.bdHandle);
            }
            break;
        }

        /* This event indicates completion of the Cy_BLE_SetPhy API*/
        case CY_BLE_EVT_SET_PHY_COMPLETE:
        {
            DEBUG_BLE("Updating the Phy.....\r\n");
            cy_stc_ble_events_param_generic_t * param =\
                    (cy_stc_ble_events_param_generic_t *)eventParam;
            if(param->status == CY_BLE_SUCCESS)
            {
                DEBUG_BLE("SET PHY updated to 2 Mbps\r\n");
            }
            else
            {
                DEBUG_BLE("SET PHY Could not update to 2 Mbps\r\n");
            }
            break;
        }

        /* This event indicates that the controller has changed the transmitter
         * PHY or receiver PHY in use */
        case CY_BLE_EVT_PHY_UPDATE_COMPLETE:
        {
            /* To remove unused parameter warning when UART debug is disabled*/
#if (DEBUG_BLE_ENABLE == ENABLE)
            DEBUG_BLE("UPDATE PHY parameters\r\n");
            cy_stc_ble_events_param_generic_t *param =\
                                (cy_stc_ble_events_param_generic_t *)eventParam;
            cy_stc_ble_phy_param_t *phyparam = NULL;
            if(param->status == CY_BLE_SUCCESS)
            {
                phyparam = (cy_stc_ble_phy_param_t *)param->eventParams;
                DEBUG_BLE("RxPhy Mask : 0x%02X\r\nTxPhy Mask : 0x%02X\r\n",\
                        phyparam->rxPhyMask, phyparam->txPhyMask);
            }
#endif
            break;
        }

        /***********************************************************************
         *                       GATT Events
         **********************************************************************/

        /* This event is generated at the GAP Peripheral end after a connection
         * is completed with a peer Central device. For a GAP Central device,
         * this event is generated as in acknowledgment of receiving this event
         * successfully by the BLE Controller.
         */
        case CY_BLE_EVT_GATT_CONNECT_IND:
        {
            /* Connected as Central (master role) */
            conn_handle = *(cy_stc_ble_conn_handle_t *)eventParam;

            /* Turn the connected LED on */
            cyhal_gpio_write((cyhal_gpio_t)CYBSP_USER_LED1, CYBSP_LED_STATE_ON);

            DEBUG_BLE("CY_BLE_EVT_GATT_CONNECT_IND: attId=%X, bdHandle=%X\r\n",\
                       conn_handle.attId, conn_handle.bdHandle);
            printf("\n\rConnected to Device\r\n\n");

            /* Initiate an MTU exchange request */
            cy_stc_ble_gatt_xchg_mtu_param_t mtuParam = {conn_handle,\
                                                         GATT_MTU_MAX};
            api_result = Cy_BLE_GATTC_ExchangeMtuReq(&mtuParam);

            if(api_result != CY_BLE_SUCCESS)
            {
                DEBUG_BLE("Cy_BLE_GATTC_ExchangeMtuReq API Error: %xd \r\n",\
                           api_result);
            }
            break;
        }

        /* GATT MTU Exchange response from the server device. */
        case CY_BLE_EVT_GATTC_XCHNG_MTU_RSP:
        {
            cy_stc_ble_gattc_write_req_t write_req;
            /* To remove unused parameter warning when UART debug is disabled */
#if (DEBUG_BLE_ENABLE == ENABLE)
            cy_stc_ble_gatt_xchg_mtu_param_t *resp =\
                                 (cy_stc_ble_gatt_xchg_mtu_param_t *)eventParam;
            DEBUG_BLE("CY_BLE_EVT_GATTC_XCHNG_MTU_RSP"\
                      "[bdHandle 0x%02X MTU %hu]\r\n",\
                       resp->connHandle.bdHandle, resp->mtu);
#endif
            cccd_val[0] = ENABLE;
            write_req.connHandle = conn_handle;
            write_req.handleValPair.attrHandle = CAPSENSE_DS_CCCD_HANDLE;
            write_req.handleValPair.value.val = cccd_val;
            write_req.handleValPair.value.len = GATT_CCCD_LEN;

            /* Enable notification to receive data */
            api_result = Cy_BLE_GATTC_WriteCharacteristicDescriptors(&write_req);
            if(api_result != CY_BLE_SUCCESS)
            {
                DEBUG_BLE("Failed to enable notification"\
                          " [bdhandle 0x%02X]: \r\n", write_req.connHandle.bdHandle);
                ble_assert();
            }
            else
            {
                DEBUG_BLE("Enabling notification [bdhandle 0x%02X]\r\n",\
                           write_req.connHandle.bdHandle);
            }
            break;
        }

