Infineon/mtb-example-psoc6-ble-capsense-tuner-client/tuner_ble_client.c
        /* Disconnection event */
        case CY_BLE_EVT_GATT_DISCONNECT_IND:
        {
            DEBUG_BLE("CY_BLE_EVT_GATT_DISCONNECT_IND \r\n");
            if(conn_handle.bdHandle ==\
                             (*(cy_stc_ble_conn_handle_t *)eventParam).bdHandle)
            {
                printf("Disconnected.\r\n\n");
                conn_handle.bdHandle = 0xFF;
                conn_handle.attId    = 0xFF;
            }
            /* Free the tuner buffer memory */
            clear_tuner_buffer();

            /* BLE connection disconnected. Turn OFF the LED */
            cyhal_gpio_write((cyhal_gpio_t)CYBSP_USER_LED1,\
                              CYBSP_LED_STATE_OFF);
            bridge_initialised = false;
            printf("Scanning for GAP Peripheral with device name %s\n\r",\
                                                               target_name);

            /* Start scan */
            Cy_BLE_GAPC_StartScan(CY_BLE_SCANNING_FAST,\
                                  CY_BLE_CENTRAL_CONFIGURATION_0_INDEX);
            break;
        }

        case CY_BLE_EVT_GATTC_WRITE_RSP:
        {
            /* Write response for the CCCD write; this means that the
             * notifications are now enabled. */
            printf("Notifications enabled successfully. Receiving data..\r\n");
            break;
        }

        case CY_BLE_EVT_GATTC_HANDLE_VALUE_NTF:
        {
            uint16_t buffer_size = 0;
            uint8_t status = 0;
            notification_data = *(cy_stc_ble_gattc_handle_value_ntf_param_t *)eventParam;

            if(notification_data.handleValPair.attrHandle == CAPSENSE_DS_CHAR_HANDLE)
            {
                if((notification_data.handleValPair.value.len == TUNER_BRIDGE_INIT_NTF_SIZE) &&\
                        bridge_initialised == false)
                {
                    printf("Received Tuner Bridge initialization parameters: \n\r");
                    /* Bridge Parameters */
                    buffer_size =\
                        (notification_data.handleValPair.value.val[CAPSENSE_DS_SIZE_MSB_IDX ] << 8) |\
                        (notification_data.handleValPair.value.val[CAPSENSE_DS_SIZE_LSB_IDX]);
                    max_notificaion_count =\
                            notification_data.handleValPair.value.val[NOTIFICATION_COUNT_IDX];

                    printf("CapSense data structure size: %u\n\r", buffer_size);
                    printf("No of notifications to completely receive CapSense"\
                           " data structure: %u\n\r", max_notificaion_count);

                    /* Set the buffer based on CapSense data structure size  */
                    status = set_tuner_buffer(buffer_size);
                    if(status == 1u)
                    {
                        printf("\n\rBridge initialized...\n\r");
                        bridge_initialised = true;
                    }
                }
                /* CapSense Data structure received */
                else if(bridge_initialised == true)
                {
                    /* Update the ezi2c tuner buffer with received data */
                    update_ezi2c_buffer(notification_data.handleValPair.value.val,\
                                        notification_data.handleValPair.value.len);
                }
            }
            break;
        }

        /* The event is received by the Client when the Server cannot perform
         * the requested operation and sends out an error response. */
        case CY_BLE_EVT_GATTC_ERROR_RSP:
        {
            DEBUG_BLE("CY_BLE_EVT_GATTC_ERROR_RSP \r\n");
            break;
        }

        /***********************************************************************
         *                       Other Events
         **********************************************************************/
        default:
            DEBUG_BLE("Unhandled BLE event: %x\r\n", event);
            break;
        }
}


/*******************************************************************************
 * Function Name: ble_assert()
 *******************************************************************************
 * Summary: ble initialization failed, halt CPU
 *
 ******************************************************************************/
static void ble_assert(void)
{
    CY_ASSERT(CY_ASSERT_FAILED);
}


/*******************************************************************************
* Function Name: ble_capsense_process
********************************************************************************
*
* Summary:
*   -  allows the BLE stack to process pending events
*
*******************************************************************************/
void ble_process_events(void)
{
    /* Cy_BLE_ProcessEvents() allows the BLE stack to process pending events */
    Cy_BLE_ProcessEvents();
}


/*******************************************************************************
* Function Name: uint8_t* adv_parser(uint16_t AD_type,
*       cy_stc_ble_gapc_adv_report_param_t* scan_report, uint8_t* adv_type_length)
********************************************************************************
*
* Summary: This function searches adv packets for the given type.
*
* Parameters:
*  uint16_t adv_type : the type of value to be discovered
*  cy_stc_ble_gapc_adv_report_param_t* scan_report : advertisement report
*                                                    parameter
*  uint8_t* adv_type_length : length of discovered value
*
* Return:
*  uint8_t* : Pointer to the value discovered in ADV packet
*
*******************************************************************************/
static uint8_t* adv_parser(uint16_t adv_type, cy_stc_ble_gapc_adv_report_param_t*
                         scan_report, uint8_t* adv_type_length)
{
    uint8_t length =0u;
    uint8_t* pName = NULL;

    for(uint8_t i = 0u; i < scan_report->dataLen; i += (length+1))
    {
        length = scan_report->data[i];
        if(scan_report->data[i+1] == adv_type)
        {
            pName = & scan_report->data[i+2];
            *adv_type_length = length - 1;
            return (pName);
        }
    }
    return ((uint8_t*)NULL);
}


/* [] END OF FILE */